Estimated Illumination failed. Lumens not set for lighting fixture.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId LightingFixtureLumensWarning { get; }
  Visual Basic
Public Shared ReadOnly Property LightingFixtureLumensWarning As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ LightingFixtureLumensWarning {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures IlluminationFailures Class
  Autodesk.Revit.DB Namespace